// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// Console.Write("Введите число -> ");
// int number = int.Parse(Console.ReadLine()!);
// string numberString = $"{number}";
// int lenght = numberString.Length;

// if (lenght >= 3 )
// {
//     Console.Write(numberString[2]);
// }
// else
//     {
//         Console.Write("третьей цифры нет");
//     }